In [1]:
import numpy as np 
import pandas as pd

In [2]:
date = pd.read_csv('Movies.csv')

In [3]:
date.head()

,Unnamed: 0,id,title,overview,release_date,popularity,vote_average,vote_count
0,0,278,The Shawshank Redemption,Framed in the 1940s for the double murder of h...,1994-09-23,119.766,8.712,25525
1,1,238,The Godfather,"Spanning the years 1945 to 1955, a chronicle o...",1972-03-14,105.608,8.707,19420
2,2,240,The Godfather Part II,In the continuing saga of the Corleone crime f...,1974-12-20,86.122,8.600,11712
3,3,424,Schindler's List,The true story of how businessman Oskar Schind...,1993-12-15,72.147,8.571,15095
4,4,389,12 Angry Men,The defense and the prosecution have rested an...,1957-04-10,47.243,8.500,8016

In [4]:
df = date.drop(columns=['title','overview','vote_average'])

In [5]:
df.head()

   Unnamed: 0   id release_date  popularity  vote_count
0           0  278   1994-09-23     119.766       25525
1           1  238   1972-03-14     105.608       19420
2           2  240   1974-12-20      86.122       11712
3           3  424   1993-12-15      72.147       15095
4           4  389   1957-04-10      47.243        8016

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 80 entries, 0 to 79
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Unnamed: 0    80 non-null     int64
 1   id            80 non-null     int64
 2   release_date  80 non-null     object
 3   popularity    80 non-null     float64
 4   vote_count    80 non-null     int64
dtypes: float64(1), int64(3), object(1)
memory usage: 3.3+ KB

In [7]:
df['release_date'] = pd.to_datetime(df['release_date'])

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 80 entries, 0 to 79
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Unnamed: 0    80 non-null     int64
 1   id            80 non-null     int64
 2   release_date  80 non-null     datetime64[ns]
 3   popularity    80 non-null     float64
 4   vote_count    80 non-null     int64
dtypes: datetime64[ns](1), float64(1), int64(3)
memory usage: 3.3 KB

In [9]:
# Extract year
df['df_year'] = df['release_date'].dt.year

In [10]:
# Extract Month
df['df_Month'] = df['release_date'].dt.month

In [11]:
df['df_Month_Name'] = df['release_date'].dt.month_name()

In [12]:
# Extract Days
df['df_Days'] = df['release_date'].dt.day

In [13]:
# Day of week
df['df_day_of_week'] = df['release_date'].dt.dayofweek

In [16]:
df['df_Day_Name'] = df['release_date'].dt.day_name()

In [15]:
# is weekend
df['date_is_weekend'] = np.where(df['df_Day_Name'].isin(['Sunday','Saturday']), 1,0)
df.drop(columns=['Unnamed: 0','id','popularity','vote_count']).sample(6)

,release_date,df_year,df_Month,df_Month_Name,df_Days,df_day_of_week,df_Day_Name,date_is_weekend
63,1963-03-01,1963,3,March,1,4,Friday,0
18,1954-04-26,1954,4,April,26,0,Monday,0
15,1990-09-12,1990,9,September,12,2,Wednesday,0
38,2002-12-18,2002,12,December,18,2,Wednesday,0
23,1960-06-22,1960,6,June,22,2,Wednesday,0
45,1962-09-15,1962,9,September,15,5,Saturday,1

In [26]:
# Extract week of the year
# df['week_of_the_year'] = df['release_date'].dt.week
# df.drop(columns=['Unnamed: 0','id','popularity','vote_count']).sample(6)

In [29]:
# Extract Quarter
df['Quarter'] = df['release_date'].dt.quarter
df.drop(columns=['Unnamed: 0','id','popularity','vote_count']).head()

,release_date,df_year,df_Month,df_Month_Name,df_Days,df_day_of_week,df_Day_Name,date_is_weekend,Quarter
0,1994-09-23,1994,9,September,23,4,Friday,0,3
1,1972-03-14,1972,3,March,14,1,Tuesday,0,1
2,1974-12-20,1974,12,December,20,4,Friday,0,4
3,1993-12-15,1993,12,December,15,2,Wednesday,0,4
4,1957-04-10,1957,4,April,10,2,Wednesday,0,2

In [33]:
# Extract Smester
df['Smester'] = np.where(df['Quarter'].isin([1,2]),1,2)
df.drop(columns=['Unnamed: 0','id','popularity','vote_count']).head()

,release_date,df_year,df_Month,df_Month_Name,df_Days,df_day_of_week,df_Day_Name,date_is_weekend,Quarter,Smester
0,1994-09-23,1994,9,September,23,4,Friday,0,3,2
1,1972-03-14,1972,3,March,14,1,Tuesday,0,1,1
2,1974-12-20,1974,12,December,20,4,Friday,0,4,2
3,1993-12-15,1993,12,December,15,2,Wednesday,0,4,2
4,1957-04-10,1957,4,April,10,2,Wednesday,0,2,1

In [34]:
# EXtract Time elapsed between dates
import datetime

In [35]:
today = datetime.datetime.today()

In [36]:
today

datetime.datetime(2024, 2, 24, 22, 56, 33, 845982)

In [37]:
today-df['release_date']

0    10746 days 22:56:33.845982
1    18974 days 22:56:33.845982
2    17963 days 22:56:33.845982
3    11028 days 22:56:33.845982
4    24426 days 22:56:33.845982
                ...
75    1254 days 22:56:33.845982
76    1808 days 22:56:33.845982
77   21924 days 22:56:33.845982
78    1598 days 22:56:33.845982
79   28190 days 22:56:33.845982
Name: release_date, Length: 80, dtype: timedelta64[ns]

In [40]:
(today-df['release_date']).dt.days

0     10746
1     18974
2     17963
3     11028
4     24426
      ...
75     1254
76     1808
77    21924
78     1598
79    28190
Name: release_date, Length: 80, dtype: int64

In [43]:
# month passed
np.round((today - df['release_date'])/np.timedelta64(1,'M'),0)

0     347.0
1     612.0
2     579.0
3     356.0
4     788.0
      ...
75     40.0
76     58.0
77    707.0
78     52.0
79    909.0
Name: release_date, Length: 80, dtype: float64